Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>211</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Netology/src/Catalogs/Контрагенты/ObjectModule.bsl
Функция ПроверкаСтроки(ПроверяемаяСтрока);
	Цифры = "1234567890";
	Для Счетчик = 1 по СтрДлина(ПроверяемаяСтрока) Цикл
		Символ = Сред(ПроверяемаяСтрока, Счетчик,1);
		Если СтрНайти (Цифры, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	КонецПроцедуры



Процедура  ОбработкаПроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты) 
	
	
	Если РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда
		Отказ = Истина;
		Сообщить("Контрольная сумма ИНН не совпадает, проверьте правильность ввода");
	КонецЕсли;
	
	
	ЮрЛицо = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение ("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ФизЛицо = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение ("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	ДлинаИНН = СтрДлина (ИНН);
	ДлинаКПП = СтрДлина (КПП);
	
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		// Проверка ИНН для юридического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 10 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица ИНН должен быть заполнен и иметь длину 10 знаков'");
			Сообщить(ТекстСообщения); 
		ИначеЕсли НЕ ПроверкаСтроки(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		// Проверка КПП для юридического лица
		Если НЕ ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица КПП должен быть заполнен и иметь длину 9 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ПроверкаСтроки(КПП) Тогда // Проверка символов КПП
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'КПП должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		// Проверка ИНН для физического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 12 Тогда    
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица ИНН должен быть заполнен и иметь длину 12 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ПроверкаСтроки(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли; 
		
		// Проверка КПП для физического лица
		Если ЗначениеЗаполнено(КПП) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица КПП должен быть не заполнен'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		
	КонецЕсли;	
	
	
КонецПроцедуры;
